# YOLOv12l-3D with DINO ViT-B Dual-Scale Integration (P0 and P3)
# Integration of DINO Vision Transformer at P0 (early features) and P3 (mid-level features)
# Model size: Large (l)
# DINO levels: P0 and P3

nc: 8 # number of classes (KITTI: Car, Van, Truck, Pedestrian, Person_sitting, Cyclist, Tram, Misc)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512]  # YOLOv12l-3D-Large

# YOLOv12-3D-DINO backbone with dual-scale DINO integration
backbone:
  # [from, repeats, module, args]
  # Early stage (P0/2)
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2

  # DINO integration at P0 level (early features)
  # This provides high-level semantic understanding at the earliest stage
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 64]]  # 1: DINO-enhanced P0 features

  # Continue with standard backbone after DINO P0
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 2-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 4-P3/8

  # DINO integration at P3 level (mid-level features)
  # This enhances feature representation for object detection
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 256]]  # 5: DINO-enhanced P3 features

  # Continue with standard backbone
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 7-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv,  [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10

# YOLOv12-3D head (with Detect3D for 3D predictions)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat DINO-enhanced P3
  - [-1, 2, A2C2f, [256, False, -1]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect3D, [nc]] # Detect3D(P3, P4, P5) - 3D detection head
